ИС_СПОРТ_2022/src/InformationRegisters/ОценкиПрохожденияНормативов/ОценкиПрохожденияНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкиПрохожденияНормативов</name>
  <resources>
    <name>РезультатЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезультатБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипПодсчетаРезультата</name>
    <type>
      <types>EnumRef.ТипПодсчетаРезультата</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МеждународнаяВозрастнаяГруппа</name>
    <type>
      <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Норматив</name>
    <type>
      <types>CatalogRef.Нормативы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Балл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Enums/ТипыРезультатов/ТипыРезультатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРезультатов</name>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>Время</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/InformationRegisters/ОценкиПрохожденияНормативов/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ИзменитьВидимостьДоступностьНормативаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИзменитьВидимостьДоступностьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПересчетВМилСек Тогда
		ПроверитьРезультатСтроковыйПриИзменении(Отказ);
		Если Отказ Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// {Рарус kotana #7380 2020.07.24
	//Добавила условие
	Если ТекущийОбъект.Норматив.ТипРезультата = ПредопределенноеЗначение("Перечисление.ТипыРезультатов.Время") Тогда
		
		ПересчитатьВремяИзСтрокиВМиллесекунды(ТекущийОбъект);
		
	КонецЕсли; 
	// }Рарус kotana #7380 2020.07.24

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура РезультатСтроковыйПриИзменении(Элемент)
	
	ПроверитьРезультатСтроковыйПриИзменении(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НормативПриИзменении(Элемент)
	
	Запись.РезультатБулево = Ложь;
	Запись.РезультатЧисло  = 0;
	ИзменитьВидимостьДоступностьНормативаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПопытокПриИзменении(Элемент)
	
	ИзменитьВидимостьДоступностьНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьВидимостьДоступностьНаКлиенте()
	
	Элементы.ТипПодсчетаРезультата.Доступность = Запись.КоличествоПопыток>1;
	
КонецПроцедуры	

&НаСервере
Процедура ИзменитьВидимостьДоступностьНормативаНаСервере()
	
	ТипРезультата   = Запись.Норматив.ТипРезультата;
	ПересчетВМилСек = ТипРезультата = Перечисления.ТипыРезультатов.Время;
	
	Элементы.РезультатБулево.Видимость    = ТипРезультата = Перечисления.ТипыРезультатов.Булево;
	Элементы.РезультатСтроковый.Видимость = ПересчетВМилСек;
	Элементы.РезультатЧисло.Видимость     = ТипРезультата = Перечисления.ТипыРезультатов.Число;
	
	Запись.РезультатБулево = Ложь;
	
	Если ПересчетВМилСек Тогда
		ПересчитатьВремяВМиллесекундахВСтроку();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьВремяВМиллесекундахВСтроку()
	
	РезультатСтроковый = УчетСпортсменовОбщегоНазначенияКлиентСервер.ПересчитатьВремяВМиллесекундахВСтроку(Запись.РезультатЧисло);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРезультатСтроковыйПриИзменении(Отказ)
	
	Отказ = Ложь;
	УчетСпортсменовОбщегоНазначенияКлиентСервер.ПроверитьРезультатСтроковыйПриИзменении(РезультатСтроковый, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьВремяИзСтрокиВМиллесекунды(ТекущийОбъект)
	
	ТекущийОбъект.РезультатЧисло = УчетСпортсменовОбщегоНазначенияКлиентСервер.ПересчитатьВремяИзСтрокиВМиллесекунды(РезультатСтроковый);
	
КонецПроцедуры		

#КонецОбласти
